micropython/micropython/ports/nxp/board/evkmimxrt1020/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2C1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
// void BOARD_InitI2C1Pins(void) {
//   CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03u */

//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 is configured as LPI2C1_SCL */
//       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_00 */
//   IOMUXC_SetPinMux(
//       IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 is configured as LPI2C1_SDA */
//       1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_01 */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 PAD functional properties : */
//       0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Enabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 22K Ohm Pull Up
//                                                  Hyst. Enable Field: Hysteresis Disabled */
//   IOMUXC_SetPinConfig(
//       IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 PAD functional properties : */
//       0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
//                                                  Drive Strength Field: R0/6
//                                                  Speed Field: medium(100MHz)
//                                                  Open Drain Enable Field: Open Drain Enabled
//                                                  Pull / Keep Enable Field: Pull/Keeper Enabled
//                                                  Pull / Keep Select Field: Keeper
//                                                  Pull Up / Down Config. Field: 22K Ohm Pull Up
//                                                  Hyst. Enable Field: Hysteresis Disabled */
// }


/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
